#[allow(unused_variables)]
fn main() {
    // 1. 整数类型i8~128, isize, u8~128, usize
    let (a, b, c, d, e, f) = (1_i8, 1_i16, 1_i32, 1_i64, 1_i128, 1_isize);
    // 2. 浮点数类型 f32, f64
    let (a, b) = (1.01_f32, 1.01_f64);
    // 3. 浮点数不能理解的数字会产生NaN，不能用assert_eq判断两个NaN，有方法is_nan()

    // 4. 较长的数字可以使用_分割提高可读性
    let a = 1_000_000;

    // 5. 序列
    // 生成开区间1..5, 生成闭区间1..=5
    for i in 1..=5 {
        println!("{}", i);
    }
    // 6. rust的类型转换必须是显示的，永远不会做i16 -> i32这类的隐式转换
    // 7. 数字可以使用方法，字面量在使用方法时必须带上类型
    13.14_f32.round();
}
